Ran Plan for dir: `terragrunt/kubernetes/renovate` workspace: `terragrunt_kubernetes_renovate`

<details><summary>Show Output</summary>

```diff
Authenticated

01:02:16.611 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/Fjgg5HQ2P74rvn4Zxt3F68PP0xo/dVXB0NL2nqk4en7zbgvJh4aPwxE
01:02:16.635 INFO   tofu: Initializing the backend...
01:02:16.907 INFO   tofu: Initializing provider plugins...
01:02:16.907 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:02:17.280 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:02:17.401 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:02:17.497 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:02:17.884 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:02:17.969 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:02:18.066 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:02:18.226 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:02:18.378 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:02:18.413 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:02:18.427 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:02:18.503 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:02:18.523 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:02:18.534 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:02:18.566 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:02:18.601 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:02:18.602 INFO   tofu: OpenTofu has been successfully initialized!
01:02:19.229 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:02:19.229 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:02:19.229 STDOUT tofu:   ~ update in-place
01:02:19.229 STDOUT tofu: OpenTofu will perform the following actions:
01:02:19.229 STDOUT tofu:   # helm_release.renovate will be updated in-place
01:02:19.229 STDOUT tofu:   ~ resource "helm_release" "renovate" {
01:02:19.229 STDOUT tofu:       ~ id                         = "renovate" -> (known after apply)
01:02:19.229 STDOUT tofu:       ~ metadata                   = {
01:02:19.229 STDOUT tofu:           ~ app_version    = "41.30.3" -> (known after apply)
01:02:19.229 STDOUT tofu:           ~ chart          = "renovate" -> (known after apply)
01:02:19.229 STDOUT tofu:           ~ first_deployed = 1746674676 -> (known after apply)
01:02:19.229 STDOUT tofu:           ~ last_deployed  = 1752198914 -> (known after apply)
01:02:19.229 STDOUT tofu:           ~ name           = "renovate" -> (known after apply)
01:02:19.229 STDOUT tofu:           ~ namespace      = "renovate" -> (known after apply)
01:02:19.229 STDOUT tofu:           ~ revision       = 25 -> (known after apply)
01:02:19.229 STDOUT tofu:           ~ values         = jsonencode(
01:02:19.229 STDOUT tofu:                 {
01:02:19.229 STDOUT tofu:                   - envFrom  = [
01:02:19.229 STDOUT tofu:                       - {
01:02:19.229 STDOUT tofu:                           - secretRef = {
01:02:19.229 STDOUT tofu:                               - name = "renovate-env"
01:02:19.229 STDOUT tofu:                             }
01:02:19.229 STDOUT tofu:                         },
01:02:19.229 STDOUT tofu:                     ]
01:02:19.229 STDOUT tofu:                   - renovate = {
01:02:19.229 STDOUT tofu:                       - config = jsonencode(
01:02:19.229 STDOUT tofu:                             {
01:02:19.229 STDOUT tofu:                               - gitAuthor    = "YouHide Renovate Bot <youhide_renovate@none.com>"
01:02:19.229 STDOUT tofu:                               - platform     = "github"
01:02:19.229 STDOUT tofu:                               - repositories = [
01:02:19.229 STDOUT tofu:                                   - "youhide/hideForming",
01:02:19.229 STDOUT tofu:                                 ]
01:02:19.229 STDOUT tofu:                             }
01:02:19.230 STDOUT tofu:                         )
01:02:19.230 STDOUT tofu:                     }
01:02:19.230 STDOUT tofu:                 }
01:02:19.230 STDOUT tofu:             ) -> (known after apply)
01:02:19.230 STDOUT tofu:           ~ version        = "41.30.3" -> (known after apply)
01:02:19.230 STDOUT tofu:         } -> (known after apply)
01:02:19.230 STDOUT tofu:         name                       = "renovate"
01:02:19.230 STDOUT tofu:       ~ version                    = "41.30.3" -> "41.31.1"
01:02:19.230 STDOUT tofu:         # (26 unchanged attributes hidden)
01:02:19.230 STDOUT tofu:     }
01:02:19.230 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:02:19.230 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Frenovate%252Fterragrunt_kubernetes_renovate)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```